tutorials/CFD/19Prova_check_python/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4900;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4950;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5000;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       5050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       5100;
    }
)

// ************************************************************************* //
